package CharactersAndAndStrings;

public class WorkWithString {
    //3. Написать и протестировать функции работы со строками:
    //Дана строка, состоящая из слов, разделенных пробелами и знаками препинания. Определить длину самого короткого слова.
    //Дан массив слов. Заменить последние три символа слов, имеющих заданную длину на символ "$"
    //Добавить в строку пробелы после знаков препинания, если они там отсутствуют.
    //Оставить в строке только один экземпляр каждого встречающегося символа.
    //Подсчитать количество слов во введенной пользователем строке.
    //Удалить из строки ее часть с заданной позиции и заданной длины.
    //Перевернуть строку, т.е. последние символы должны стать первыми, а первые последними.
    //В заданной строке удалить последнее слово
}
